# EMPOYEES DATA ANALYSIS USING PYSPARK

In [ ]:
# Installing required packages  

!pip install pyspark  findspark wget

In [2]:
import findspark

findspark.init()

In [3]:
# PySpark is the Spark API for Python. In this lab, we use PySpark to initialize the SparkContext.   

from pyspark import SparkContext, SparkConf
from pyspark.sql.types import StructType, StructField, IntegerType, StringType, DoubleType
from pyspark.sql import SparkSession

In [4]:
# Creating a SparkContext object  

sc = SparkContext.getOrCreate()

# Creating a SparkSession  

spark = SparkSession \
    .builder \
    .appName("Employee Data Analysis") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

#### Generate a Spark DataFrame from the CSV data

Read data from the provided CSV file, `employees.csv` and import it into a Spark DataFrame variable named `employees_df`.

In [6]:
# Read data from the "emp" CSV file and import it into a DataFrame variable named "employees_df"  

employees_df=spark.read.csv('employees.csv',header=True)
employees_df.show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

#### Define a schema for the data

Construct a schema for the input data and then utilize the defined schema to read the CSV file to create a DataFrame named `employees_df`.

In [7]:
# Define a Schema for the input data and read the file using the user-defined Schema
# Define the schema
schema = StructType([
    StructField("Emp_No", IntegerType(), False),
    StructField("Emp_Name", StringType(), True),
    StructField("Salary", DoubleType(), True),
    StructField("Age", IntegerType(), True),
    StructField("Department", StringType(), True)
])

employees_df=spark.read.csv('employees.csv',schema=schema,header=True)

#### Display schema of DataFrame

Display the schema of the `employees_df` DataFrame, showing all columns and their respective data types.

In [8]:
# Display all columns of the DataFrame, along with their respective data types

employees_df.printSchema()

root
 |-- Emp_No: integer (nullable = true)
 |-- Emp_Name: string (nullable = true)
 |-- Salary: double (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Department: string (nullable = true)

#### Create a temporary view

Create a temporary view named `employees` for the `employees_df` DataFrame, enabling Spark SQL queries on the data.

In [9]:
# Create a temporary view named "employees" for the DataFrame
employees_df.createOrReplaceTempView('employees')

#### Execute an SQL query

Compose and execute an SQL query to fetch the records from the `employees` view where the age of employees exceeds 30. Then, display the result of the SQL query, showcasing the filtered records.

In [10]:
# SQL query to fetch solely the records from the View where the age exceeds 30

spark.sql('SELECT * FROM Employees WHERE age > 30;').show()

+------+-----------+-------+---+----------+
|Emp_No|   Emp_Name| Salary|Age|Department|
+------+-----------+-------+---+----------+
|   199|    Douglas| 2600.0| 34|     Sales|
|   200|   Jennifer| 4400.0| 36| Marketing|
|   201|    Michael|13000.0| 32|        IT|
|   202|        Pat| 6000.0| 39|        HR|
|   203|      Susan| 6500.0| 36| Marketing|
|   205|    Shelley|12008.0| 33|   Finance|
|   206|    William| 8300.0| 37|        IT|
|   100|     Steven|24000.0| 39|        IT|
|   102|        Lex|17000.0| 37| Marketing|
|   103|  Alexander| 9000.0| 39| Marketing|
|   104|      Bruce| 6000.0| 38|        IT|
|   105|      David| 4800.0| 39|        IT|
|   106|      Valli| 4800.0| 38|     Sales|
|   107|      Diana| 4200.0| 35|     Sales|
|   109|     Daniel| 9000.0| 35|        HR|
|   110|       John| 8200.0| 31| Marketing|
|   111|     Ismael| 7700.0| 32|        IT|
|   112|Jose Manuel| 7800.0| 34|        HR|
|   113|       Luis| 6900.0| 34|     Sales|
|   116|     Shelli| 2900.0| 37|   Finance|
+------+-----------+-------+---+----------+
only showing top 20 rows

#### Calculate Average Salary by Department

Compose an SQL query to retrieve the average salary of employees grouped by department. Display the result.

In [12]:
# SQL query to calculate the average salary of employees grouped by department
spark.sql('SELECT Department,AVG(salary) as avg_salary FROM Employees GROUP BY Department').show()

+----------+-----------------+
|Department|       avg_salary|
+----------+-----------------+
|     Sales|5492.923076923077|
|        HR|           5837.5|
|   Finance|           5730.8|
| Marketing|6633.333333333333|
|        IT|           7400.0|
+----------+-----------------+

#### Filter and Display IT Department Employees

Apply a filter on the `employees_df` DataFrame to select records where the department is `'IT'`. Display the filtered DataFrame.

In [18]:
# Apply a filter to select records where the department is 'IT'

employees_df.filter(employees_df.Department=='IT').show()

+------+--------+-------+---+----------+
|Emp_No|Emp_Name| Salary|Age|Department|
+------+--------+-------+---+----------+
|   198|  Donald| 2600.0| 29|        IT|
|   201| Michael|13000.0| 32|        IT|
|   206| William| 8300.0| 37|        IT|
|   100|  Steven|24000.0| 39|        IT|
|   104|   Bruce| 6000.0| 38|        IT|
|   105|   David| 4800.0| 39|        IT|
|   111|  Ismael| 7700.0| 32|        IT|
|   129|   Laura| 3300.0| 38|        IT|
|   132|      TJ| 2100.0| 34|        IT|
|   136|   Hazel| 2200.0| 29|        IT|
+------+--------+-------+---+----------+

####  Add 10% Bonus to Salaries

Perform a transformation to add a new column named "SalaryAfterBonus" to the DataFrame. Calculate the new salary by adding a 10% bonus to each employee's salary.

In [21]:
from pyspark.sql.functions import col

# Add a new column "SalaryAfterBonus" with 10% bonus added to the original salary
employees_df=employees_df.withColumn('SalaryAfterBonus',col('salary')+(col('salary')*0.10))
employees_df.show()

+------+---------+-------+---+----------+----------------+
|Emp_No| Emp_Name| Salary|Age|Department|SalaryAfterBonus|
+------+---------+-------+---+----------+----------------+
|   198|   Donald| 2600.0| 29|        IT|          2860.0|
|   199|  Douglas| 2600.0| 34|     Sales|          2860.0|
|   200| Jennifer| 4400.0| 36| Marketing|          4840.0|
|   201|  Michael|13000.0| 32|        IT|         14300.0|
|   202|      Pat| 6000.0| 39|        HR|          6600.0|
|   203|    Susan| 6500.0| 36| Marketing|          7150.0|
|   204|  Hermann|10000.0| 29|   Finance|         11000.0|
|   205|  Shelley|12008.0| 33|   Finance|         13208.8|
|   206|  William| 8300.0| 37|        IT|          9130.0|
|   100|   Steven|24000.0| 39|        IT|         26400.0|
|   101|    Neena|17000.0| 27|     Sales|         18700.0|
|   102|      Lex|17000.0| 37| Marketing|         18700.0|
|   103|Alexander| 9000.0| 39| Marketing|          9900.0|
|   104|    Bruce| 6000.0| 38|        IT|          6600.0|
|   105|    David| 4800.0| 39|        IT|          5280.0|
|   106|    Valli| 4800.0| 38|     Sales|          5280.0|
|   107|    Diana| 4200.0| 35|     Sales|          4620.0|
|   108|    Nancy|12008.0| 28|     Sales|         13208.8|
|   109|   Daniel| 9000.0| 35|        HR|          9900.0|
|   110|     John| 8200.0| 31| Marketing|          9020.0|
+------+---------+-------+---+----------+----------------+
only showing top 20 rows

#### Find Maximum Salary by Age

Group the data by age and calculate the maximum salary for each age group. Display the result.

In [23]:
from pyspark.sql.functions import max

# Group data by age and calculate the maximum salary for each age group

employees_df.groupBy('age').agg(max(col('salary')).alias('Max_Salary')).show(5)

+---+----------+
|age|Max_Salary|
+---+----------+
| 31|    8200.0|
| 34|    7800.0|
| 28|   12008.0|
| 27|   17000.0|
| 26|    3600.0|
+---+----------+
only showing top 5 rows

#### Self-Join on Employee Data

Join the "employees_df" DataFrame with itself based on the "Emp_No" column. Display the result.

In [25]:
# Join the DataFrame with itself based on the "Emp_No" column
employees_df.join(employees_df,on='Emp_No').show()

+------+---------+-------+---+----------+----------------+---------+-------+---+----------+----------------+
|Emp_No| Emp_Name| Salary|Age|Department|SalaryAfterBonus| Emp_Name| Salary|Age|Department|SalaryAfterBonus|
+------+---------+-------+---+----------+----------------+---------+-------+---+----------+----------------+
|   198|   Donald| 2600.0| 29|        IT|          2860.0|   Donald| 2600.0| 29|        IT|          2860.0|
|   199|  Douglas| 2600.0| 34|     Sales|          2860.0|  Douglas| 2600.0| 34|     Sales|          2860.0|
|   200| Jennifer| 4400.0| 36| Marketing|          4840.0| Jennifer| 4400.0| 36| Marketing|          4840.0|
|   201|  Michael|13000.0| 32|        IT|         14300.0|  Michael|13000.0| 32|        IT|         14300.0|
|   202|      Pat| 6000.0| 39|        HR|          6600.0|      Pat| 6000.0| 39|        HR|          6600.0|
|   203|    Susan| 6500.0| 36| Marketing|          7150.0|    Susan| 6500.0| 36| Marketing|          7150.0|
|   204|  Hermann|10000.0| 29|   Finance|         11000.0|  Hermann|10000.0| 29|   Finance|         11000.0|
|   205|  Shelley|12008.0| 33|   Finance|         13208.8|  Shelley|12008.0| 33|   Finance|         13208.8|
|   206|  William| 8300.0| 37|        IT|          9130.0|  William| 8300.0| 37|        IT|          9130.0|
|   100|   Steven|24000.0| 39|        IT|         26400.0|   Steven|24000.0| 39|        IT|         26400.0|
|   101|    Neena|17000.0| 27|     Sales|         18700.0|    Neena|17000.0| 27|     Sales|         18700.0|
|   102|      Lex|17000.0| 37| Marketing|         18700.0|      Lex|17000.0| 37| Marketing|         18700.0|
|   103|Alexander| 9000.0| 39| Marketing|          9900.0|Alexander| 9000.0| 39| Marketing|          9900.0|
|   104|    Bruce| 6000.0| 38|        IT|          6600.0|    Bruce| 6000.0| 38|        IT|          6600.0|
|   105|    David| 4800.0| 39|        IT|          5280.0|    David| 4800.0| 39|        IT|          5280.0|
|   106|    Valli| 4800.0| 38|     Sales|          5280.0|    Valli| 4800.0| 38|     Sales|          5280.0|
|   107|    Diana| 4200.0| 35|     Sales|          4620.0|    Diana| 4200.0| 35|     Sales|          4620.0|
|   108|    Nancy|12008.0| 28|     Sales|         13208.8|    Nancy|12008.0| 28|     Sales|         13208.8|
|   109|   Daniel| 9000.0| 35|        HR|          9900.0|   Daniel| 9000.0| 35|        HR|          9900.0|
|   110|     John| 8200.0| 31| Marketing|          9020.0|     John| 8200.0| 31| Marketing|          9020.0|
+------+---------+-------+---+----------+----------------+---------+-------+---+----------+----------------+
only showing top 20 rows

#### Calculate Average Employee Age

Calculate the average age of employees using the built-in aggregation function. Display the result.

In [26]:
# Calculate the average age of employees
from pyspark.sql.functions import avg 

employees_df.agg(avg(col('age')).alias('avg_age')).show()

+-------+
|avg_age|
+-------+
|  33.56|
+-------+

#### Calculate Total Salary by Department

Calculate the total salary for each department using the built-in aggregation function. Display the result.

In [27]:
# Calculate the total salary for each department. 
from pyspark.sql.functions import sum 

employees_df.groupBy('Department').agg(sum(col('salary')).alias('Total_Salary')).show(5)

+----------+------------+
|Department|Total_Salary|
+----------+------------+
|     Sales|     71408.0|
|        HR|     46700.0|
|   Finance|     57308.0|
| Marketing|     59700.0|
|        IT|     74000.0|
+----------+------------+

#### Sort Data by Age and Salary

Apply a transformation to sort the DataFrame by age in ascending order and then by salary in descending order. Display the sorted DataFrame.

In [35]:
# Sort the DataFrame by age in ascending order and then by salary in descending order
employees_df.sort(col('age'),ascending=True).sort(col('salary'),ascending=False).show()

+------+-----------+-------+---+----------+----------------+
|Emp_No|   Emp_Name| Salary|Age|Department|SalaryAfterBonus|
+------+-----------+-------+---+----------+----------------+
|   100|     Steven|24000.0| 39|        IT|         26400.0|
|   101|      Neena|17000.0| 27|     Sales|         18700.0|
|   102|        Lex|17000.0| 37| Marketing|         18700.0|
|   201|    Michael|13000.0| 32|        IT|         14300.0|
|   205|    Shelley|12008.0| 33|   Finance|         13208.8|
|   108|      Nancy|12008.0| 28|     Sales|         13208.8|
|   114|        Den|11000.0| 27|   Finance|         12100.0|
|   204|    Hermann|10000.0| 29|   Finance|         11000.0|
|   103|  Alexander| 9000.0| 39| Marketing|          9900.0|
|   109|     Daniel| 9000.0| 35|        HR|          9900.0|
|   206|    William| 8300.0| 37|        IT|          9130.0|
|   110|       John| 8200.0| 31| Marketing|          9020.0|
|   121|       Adam| 8200.0| 39|        HR|          9020.0|
|   120|    Matthew| 8000.0| 30|        HR|          8800.0|
|   122|      Payam| 7900.0| 36|   Finance|          8690.0|
|   112|Jose Manuel| 7800.0| 34|        HR|          8580.0|
|   111|     Ismael| 7700.0| 32|        IT|          8470.0|
|   113|       Luis| 6900.0| 34|     Sales|          7590.0|
|   203|      Susan| 6500.0| 36| Marketing|          7150.0|
|   123|     Shanta| 6500.0| 35|     Sales|          7150.0|
+------+-----------+-------+---+----------+----------------+
only showing top 20 rows

#### Count Employees in Each Department

Calculate the number of employees in each department. Display the result.

In [30]:
from pyspark.sql.functions import count

# Calculate the number of employees in each department
employees_df.groupBy('Department').agg(count(col('Emp_No')).alias('Total_Employees')).show(5)

+----------+---------------+
|Department|Total_Employees|
+----------+---------------+
|     Sales|             13|
|        HR|              8|
|   Finance|             10|
| Marketing|              9|
|        IT|             10|
+----------+---------------+

#### Filter Employees with the letter o in the Name

Apply a filter to select records where the employee's name contains the letter `'o'`. Display the filtered DataFrame.

In [32]:
# Apply a filter to select records where the employee's name contains the letter 'o'
employees_df.filter(col('Emp_Name').contains('o')).show()

+------+-----------+------+---+----------+----------------+
|Emp_No|   Emp_Name|Salary|Age|Department|SalaryAfterBonus|
+------+-----------+------+---+----------+----------------+
|   198|     Donald|2600.0| 29|        IT|          2860.0|
|   199|    Douglas|2600.0| 34|     Sales|          2860.0|
|   110|       John|8200.0| 31| Marketing|          9020.0|
|   112|Jose Manuel|7800.0| 34|        HR|          8580.0|
|   130|      Mozhe|2800.0| 28| Marketing|          3080.0|
|   133|      Jason|3300.0| 38|     Sales|          3630.0|
|   139|       John|2700.0| 36|     Sales|          2970.0|
|   140|     Joshua|2500.0| 29|   Finance|          2750.0|
+------+-----------+------+---+----------+----------------+